WS-composicao-simples/LoanRequestorCompositeApp/src/jbiServiceUnits/LoanRequestor/LoanRequestor.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="LoanRequestor" targetNamespace="http://j2ee.netbeans.org/wsdl/LoanRequestor/src/LoanRequestor"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/LoanRequestor/src/LoanRequestor" xmlns:ns="http://xml.netbeans.org/schema/LoanRequestor" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/LoanRequestor/src/LoanRequestor">
            <xsd:import namespace="http://xml.netbeans.org/schema/LoanRequestor" schemaLocation="LoanRequestor.xsd"/>
        </xsd:schema>
    </types>
    <message name="LoanRequestorOperationRequest">
        <part name="requestLoanMessage" element="ns:processApplicElement"/>
    </message>
    <message name="LoanRequestorOperationResponse">
        <part name="responsePart" element="ns:processApplicRespElement"/>
    </message>
    <portType name="LoanRequestorPortType">
        <operation name="LoanRequestorOperation">
            <input name="input1" message="tns:LoanRequestorOperationRequest"/>
            <output name="output1" message="tns:LoanRequestorOperationResponse"/>
        </operation>
    </portType>
    <plnk:partnerLinkType name="LoanRequestor">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="LoanRequestorPortTypeRole" portType="tns:LoanRequestorPortType"/>
    </plnk:partnerLinkType>
</definitions>
